Netology/src/DataProcessors/ЗагрузкаПрайсИзФайлаXlsx/ЗагрузкаПрайсИзФайлаXlsx.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПрайсИзФайлаXlsx</name>
</mdclass:DataProcessor>

Netology/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/DataProcessors/ЗагрузкаПрайсИзФайлаXlsx/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Функция ЗагрузитьФайлНаСервере(АдресФайлаВоВременномХранилище, УникальныйИдентификатор)

	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);

	РезультатЗагрузки = Новый Структура("ВсяНоменклатураНайдена, АдресДанныхФайла", Истина, Неопределено);
	ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор);

	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);

	Возврат РезультатЗагрузки;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуру(ДанныеФайла)
	
	ВсяНоменклатураНайдена = Истина;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ДанныеСтроки.НаименованиеНоменклатуры);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, ДанныеСтроки.НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			ВсяНоменклатураНайдена = Ложь;
		КонецЕсли;

		ДанныеСтроки.Вставить("НоменклатураСсылка", Номенклатура);

	КонецЦикла;

	Возврат ВсяНоменклатураНайдена;

КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор)

	ТекстовыйФайлЗагрузки = Новый ТекстовыйДокумент;
	ТекстовыйФайлЗагрузки.Прочитать(ИмяВременногоФайла, КодировкаТекста.UTF8);

	ДанныеФайла = Новый Массив;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	Для НомерСтроки = 1 по ТекстовыйФайлЗагрузки.КоличествоСтрок() Цикл

		НоваяСтрока = ТекстовыйФайлЗагрузки.ПолучитьСтроку(НомерСтроки);

		Позиция = Найти(НоваяСтрока, ";");

		НаименованиеНоменклатуры = Сред(НоваяСтрока, 1, Позиция - 1);
		Цена = Сред(НоваяСтрока, Позиция + 1);

		ДанныеСтрокиДокумента = Новый Структура;
		ДанныеСтрокиДокумента.Вставить("НаименованиеНоменклатуры", НаименованиеНоменклатуры);
		ДанныеСтрокиДокумента.Вставить("Цена", Цена);

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры); 
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			РезультатЗагрузки.ВсяНоменклатураНайдена = Ложь;
		КонецЕсли;
		ДанныеСтрокиДокумента.Вставить("НоменклатураСсылка", Номенклатура);
		
		ДанныеФайла.Добавить(ДанныеСтрокиДокумента);

	КонецЦикла;

	РезультатЗагрузки.АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьФайлАсинхронно();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для загрузки данных";
	Диалог.Фильтр = "Excel-файлы|*.xlsx";

	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();

	Если РезультатВыбора = Неопределено Тогда
		// Пользователь ничего не выбрал
		Возврат;
	КонецЕсли;

	ПутьКФайлу = РезультатВыбора[0];

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьФайл();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьФайл()

	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(, , , ПутьКФайлу, УникальныйИдентификатор);
	СоздатьДокумент(Контрагент, ОписаниеФайла.Адрес);	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Контрагент, АдресФайла)

	Данные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Данные.Записать(ИмяПромежуточногоФайла);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяПромежуточногоФайла);

	// Создаём новый документ
	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Контрагент;
	ДокументЦены.Комментарий = "Загружен из файла";

	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	// Начинаем со 2 строки т.к. в 1-й заголовки колонок
	Для Сч = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 

		ИмяНоменклатуры = ТабличныйДокумент.Область(Сч, 1).Текст;
		Цена = ТабличныйДокумент.Область(Сч, 2).Текст;		

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ИмяНоменклатуры);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, ИмяНоменклатуры);
			Сообщение.Сообщить();

			Продолжить;

		КонецЕсли;

		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		НоваяСтрокаТЧ.Цена = ОписаниеТипаЧисло.ПривестиЗначение(Цена);

	КонецЦикла;

	ДокументЦены.Записать(РежимЗаписиДокумента.Запись);

	УдалитьФайлы(ИмяПромежуточногоФайла);
КонецПроцедуры
